{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"State","class_name":"InputLayer","config":{"batch_input_shape":[null,189],"dtype":"float32","sparse":false,"name":"State"},"inbound_nodes":[]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["State",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"dense_Dense3","class_name":"Dense","config":{"units":1024,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]},{"name":"add_Add1","class_name":"Add","config":{"name":"add_Add1","trainable":true},"inbound_nodes":[[["dense_Dense3",0,0,{}],["dense_Dense1",0,0,{}]]]},{"name":"re_lu_ReLU1","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU1","trainable":true},"inbound_nodes":[[["add_Add1",0,0,{}]]]},{"name":"dense_Dense4","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true},"inbound_nodes":[[["re_lu_ReLU1",0,0,{}]]]},{"name":"dense_Dense5","class_name":"Dense","config":{"units":1024,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true},"inbound_nodes":[[["dense_Dense4",0,0,{}]]]},{"name":"add_Add2","class_name":"Add","config":{"name":"add_Add2","trainable":true},"inbound_nodes":[[["dense_Dense5",0,0,{}],["re_lu_ReLU1",0,0,{}]]]},{"name":"re_lu_ReLU2","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU2","trainable":true},"inbound_nodes":[[["add_Add2",0,0,{}]]]},{"name":"dense_Dense6","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true},"inbound_nodes":[[["re_lu_ReLU2",0,0,{}]]]},{"name":"dense_Dense7","class_name":"Dense","config":{"units":1024,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true},"inbound_nodes":[[["dense_Dense6",0,0,{}]]]},{"name":"add_Add3","class_name":"Add","config":{"name":"add_Add3","trainable":true},"inbound_nodes":[[["dense_Dense7",0,0,{}],["re_lu_ReLU2",0,0,{}]]]},{"name":"re_lu_ReLU3","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU3","trainable":true},"inbound_nodes":[[["add_Add3",0,0,{}]]]},{"name":"dense_Dense8","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true},"inbound_nodes":[[["re_lu_ReLU3",0,0,{}]]]},{"name":"dense_Dense9","class_name":"Dense","config":{"units":1024,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense9","trainable":true},"inbound_nodes":[[["dense_Dense8",0,0,{}]]]},{"name":"add_Add4","class_name":"Add","config":{"name":"add_Add4","trainable":true},"inbound_nodes":[[["dense_Dense9",0,0,{}],["re_lu_ReLU3",0,0,{}]]]},{"name":"re_lu_ReLU4","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU4","trainable":true},"inbound_nodes":[[["add_Add4",0,0,{}]]]},{"name":"dense_Dense10","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10","trainable":true},"inbound_nodes":[[["re_lu_ReLU4",0,0,{}]]]},{"name":"dense_Dense11","class_name":"Dense","config":{"units":1024,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true},"inbound_nodes":[[["dense_Dense10",0,0,{}]]]},{"name":"add_Add5","class_name":"Add","config":{"name":"add_Add5","trainable":true},"inbound_nodes":[[["dense_Dense11",0,0,{}],["re_lu_ReLU4",0,0,{}]]]},{"name":"re_lu_ReLU5","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU5","trainable":true},"inbound_nodes":[[["add_Add5",0,0,{}]]]},{"name":"dense_Dense12","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true},"inbound_nodes":[[["re_lu_ReLU5",0,0,{}]]]},{"name":"dense_Dense13","class_name":"Dense","config":{"units":1024,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true},"inbound_nodes":[[["dense_Dense12",0,0,{}]]]},{"name":"add_Add6","class_name":"Add","config":{"name":"add_Add6","trainable":true},"inbound_nodes":[[["dense_Dense13",0,0,{}],["re_lu_ReLU5",0,0,{}]]]},{"name":"re_lu_ReLU6","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU6","trainable":true},"inbound_nodes":[[["add_Add6",0,0,{}]]]},{"name":"dense_Dense14","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense14","trainable":true},"inbound_nodes":[[["re_lu_ReLU6",0,0,{}]]]},{"name":"dense_Dense15","class_name":"Dense","config":{"units":1024,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense15","trainable":true},"inbound_nodes":[[["dense_Dense14",0,0,{}]]]},{"name":"add_Add7","class_name":"Add","config":{"name":"add_Add7","trainable":true},"inbound_nodes":[[["dense_Dense15",0,0,{}],["re_lu_ReLU6",0,0,{}]]]},{"name":"re_lu_ReLU7","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU7","trainable":true},"inbound_nodes":[[["add_Add7",0,0,{}]]]},{"name":"dense_Dense16","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense16","trainable":true},"inbound_nodes":[[["re_lu_ReLU7",0,0,{}]]]},{"name":"dense_Dense17","class_name":"Dense","config":{"units":1024,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense17","trainable":true},"inbound_nodes":[[["dense_Dense16",0,0,{}]]]},{"name":"add_Add8","class_name":"Add","config":{"name":"add_Add8","trainable":true},"inbound_nodes":[[["dense_Dense17",0,0,{}],["re_lu_ReLU7",0,0,{}]]]},{"name":"re_lu_ReLU8","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU8","trainable":true},"inbound_nodes":[[["add_Add8",0,0,{}]]]},{"name":"dense_Dense18","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18","trainable":true},"inbound_nodes":[[["re_lu_ReLU8",0,0,{}]]]},{"name":"dense_Dense19","class_name":"Dense","config":{"units":1024,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense19","trainable":true},"inbound_nodes":[[["dense_Dense18",0,0,{}]]]},{"name":"add_Add9","class_name":"Add","config":{"name":"add_Add9","trainable":true},"inbound_nodes":[[["dense_Dense19",0,0,{}],["re_lu_ReLU8",0,0,{}]]]},{"name":"re_lu_ReLU9","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU9","trainable":true},"inbound_nodes":[[["add_Add9",0,0,{}]]]},{"name":"dense_Dense20","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense20","trainable":true},"inbound_nodes":[[["re_lu_ReLU9",0,0,{}]]]},{"name":"dense_Dense21","class_name":"Dense","config":{"units":1024,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense21","trainable":true},"inbound_nodes":[[["dense_Dense20",0,0,{}]]]},{"name":"add_Add10","class_name":"Add","config":{"name":"add_Add10","trainable":true},"inbound_nodes":[[["dense_Dense21",0,0,{}],["re_lu_ReLU9",0,0,{}]]]},{"name":"re_lu_ReLU10","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU10","trainable":true},"inbound_nodes":[[["add_Add10",0,0,{}]]]},{"name":"dense_Dense22","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22","trainable":true},"inbound_nodes":[[["re_lu_ReLU10",0,0,{}]]]},{"name":"dense_Dense23","class_name":"Dense","config":{"units":1024,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense23","trainable":true},"inbound_nodes":[[["dense_Dense22",0,0,{}]]]},{"name":"add_Add11","class_name":"Add","config":{"name":"add_Add11","trainable":true},"inbound_nodes":[[["dense_Dense23",0,0,{}],["re_lu_ReLU10",0,0,{}]]]},{"name":"re_lu_ReLU11","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU11","trainable":true},"inbound_nodes":[[["add_Add11",0,0,{}]]]},{"name":"dense_Dense24","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense24","trainable":true},"inbound_nodes":[[["re_lu_ReLU11",0,0,{}]]]},{"name":"dense_Dense25","class_name":"Dense","config":{"units":1024,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense25","trainable":true},"inbound_nodes":[[["dense_Dense24",0,0,{}]]]},{"name":"add_Add12","class_name":"Add","config":{"name":"add_Add12","trainable":true},"inbound_nodes":[[["dense_Dense25",0,0,{}],["re_lu_ReLU11",0,0,{}]]]},{"name":"re_lu_ReLU12","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU12","trainable":true},"inbound_nodes":[[["add_Add12",0,0,{}]]]},{"name":"dense_Dense26","class_name":"Dense","config":{"units":512,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense26","trainable":true},"inbound_nodes":[[["re_lu_ReLU12",0,0,{}]]]},{"name":"dense_Dense27","class_name":"Dense","config":{"units":81,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense27","trainable":true},"inbound_nodes":[[["dense_Dense26",0,0,{}]]]},{"name":"AvailableActions","class_name":"InputLayer","config":{"batch_input_shape":[null,81],"dtype":"float32","sparse":false,"name":"AvailableActions"},"inbound_nodes":[]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["dense_Dense27",0,0,{}],["AvailableActions",0,0,{}]]]},{"name":"dense_Dense28","class_name":"Dense","config":{"units":512,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense28","trainable":true},"inbound_nodes":[[["re_lu_ReLU12",0,0,{}]]]},{"name":"ActionProbabilities","class_name":"ActionProbabilityLayer","config":{"name":"ActionProbabilities","trainable":true,"target_shape":81},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"Value","class_name":"Dense","config":{"units":1,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Value","trainable":true},"inbound_nodes":[[["dense_Dense28",0,0,{}]]]}],"input_layers":[["State",0,0],["AvailableActions",0,0]],"output_layers":[["ActionProbabilities",0,0],["Value",0,0]]},"keras_version":"tfjs-layers 3.21.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[189,1024],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense7/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense7/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense8/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense8/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense9/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense9/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense10/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense10/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense11/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense12/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense12/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense13/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense14/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense14/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense15/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense15/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense16/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense16/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense17/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense17/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense18/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense18/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense19/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense19/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense20/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense20/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense21/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense21/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense22/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense22/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense23/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense23/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense24/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense24/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense25/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense25/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense26/kernel","shape":[1024,512],"dtype":"float32"},{"name":"dense_Dense26/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense27/kernel","shape":[512,81],"dtype":"float32"},{"name":"dense_Dense27/bias","shape":[81],"dtype":"float32"},{"name":"dense_Dense28/kernel","shape":[1024,512],"dtype":"float32"},{"name":"dense_Dense28/bias","shape":[512],"dtype":"float32"},{"name":"Value/kernel","shape":[512,1],"dtype":"float32"},{"name":"Value/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.21.0","convertedBy":null}